Repository: 0xUrsa/rescuezilla
Catalog: src/livecd/image/boot/grub/locale/*.po
Languages: it

source: Start Rescuezilla
it: Avvia Rescuezilla

source: If boot fails, reboot and try selecting Graphical fallback instead
it: Se il boot non va a buon fine, riavvia e prova a selezionare la modalità grafica alternativa

source: Graphical fallback mode
it: Modalità video alternativa

source: Use low-resolution fallback graphics driver if standard mode doesn't work for your hardware
it: Utilizza i driver grafici a bassa risoluzione se la modalità standard non funziona sul tuo hardware

source: Load USB into RAM
it: Carica Filezilla in RAM

source: Loads Rescuezilla into memory allowing the boot media to be ejected after bootup
it: Carica Rescuezilla in memoria per poter espellere il dispositivo di caricamento dopo l'avvio

source: Check USB for defects
it: Verifica difetti dell'USB

source: Verify integrity of USB drive
it: Verifica l'integrità del dispositivo USB

source: Enter BIOS Setup
it: Accedi alle impostazioni del BIOS

source: Configure machine's firmware, boot options etc
it: Configura il firmware della macchina, le opzioni di avvio, ecc

source: Memory test
it: Verifica della memoria RAM

source: Check computer memory for errors
it: Verificare la presenza di errori nella RAM del computer
